app/controllers/cities_controller.rb

SELECT * FROM "cities" WHERE (name like 's%') ORDER BY name
---
  def index
    conditions = (params[:q] ? {:conditions => ["name like ?", "#{params[:q]}%"]} : {})
    @cities = City.all(conditions.merge(:order => "name"))

SELECT * FROM "cities" WHERE ("cities"."name" = '') LIMIT 1
---
  def create
    combo_city = City.find(params[:combo_cities]).name